----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\GitHub\panel_econ\exam2\stata\exam_2_q3_1_a.log
  log type:  text
 opened on:  16 Nov 2015, 19:53:52

. *@*lstart
. local x regime trade_openness gdpgrowth finance

. 
. reg abs_cagdp `x'

      Source |       SS           df       MS      Number of obs   =     1,855
-------------+----------------------------------   F(4, 1850)      =     73.03
       Model |  9397.16018         4  2349.29004   Prob > F        =    0.0000
    Residual |  59512.4541     1,850  32.1688941   R-squared       =    0.1364
-------------+----------------------------------   Adj R-squared   =    0.1345
       Total |  68909.6142     1,854  37.1680767   Root MSE        =    5.6718

--------------------------------------------------------------------------------
     abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        regime |   1.199144   .1743265     6.88   0.000     .8572467    1.541041
trade_openness |   .0391744    .003697    10.60   0.000     .0319237    .0464251
     gdpgrowth |   .0589071   .0325478     1.81   0.070    -.0049273    .1227415
       finance |  -.2897215   .0897705    -3.23   0.001    -.4657837   -.1136593
         _cons |   1.192841   .3255092     3.66   0.000     .5544373    1.831245
--------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of abs_cagdp

         chi2(1)      =   438.51
         Prob > chi2  =   0.0000

. est store ols

. 
. xtreg abs_cagdp `x', fe

Fixed-effects (within) regression               Number of obs     =      1,855
Group variable: country2                        Number of groups  =         59

R-sq:                                           Obs per group:
     within  = 0.0181                                         min =         16
     between = 0.3106                                         avg =       31.4
     overall = 0.1237                                         max =         35

                                                F(4,1792)         =       8.25
corr(u_i, Xb)  = 0.1975                         Prob > F          =     0.0000

--------------------------------------------------------------------------------
     abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        regime |   .7194034   .2112564     3.41   0.001     .3050687    1.133738
trade_openness |   .0292849   .0075704     3.87   0.000     .0144372    .0441326
     gdpgrowth |   .0618739   .0288483     2.14   0.032     .0052941    .1184537
       finance |   .0810876   .1213976     0.67   0.504     -.157008    .3191833
         _cons |   2.424857   .6668928     3.64   0.000     1.116888    3.732826
---------------+----------------------------------------------------------------
       sigma_u |  3.3211165
       sigma_e |  4.8303098
           rho |  .32099147   (fraction of variance due to u_i)
--------------------------------------------------------------------------------
F test that all u_i=0: F(58, 1792) = 13.08                   Prob > F = 0.0000

. 
. est store fe

. 
. xtreg abs_cagdp `x', re

Random-effects GLS regression                   Number of obs     =      1,855
Group variable: country2                        Number of groups  =         59

R-sq:                                           Obs per group:
     within  = 0.0177                                         min =         16
     between = 0.3262                                         avg =       31.4
     overall = 0.1295                                         max =         35

                                                Wald chi2(4)      =      57.57
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

--------------------------------------------------------------------------------
     abs_cagdp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        regime |   .8366188   .2005195     4.17   0.000     .4436077     1.22963
trade_openness |   .0354598   .0063022     5.63   0.000     .0231076    .0478119
     gdpgrowth |   .0611339   .0287436     2.13   0.033     .0047974    .1174704
       finance |  -.0079567   .1142987    -0.07   0.945    -.2319781    .2160647
         _cons |   1.928826   .6912215     2.79   0.005     .5740567    3.283595
---------------+----------------------------------------------------------------
       sigma_u |  3.0927035
       sigma_e |  4.8303098
           rho |  .29075295   (fraction of variance due to u_i)
--------------------------------------------------------------------------------

. est store re

. 
. hausman fe re

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |       fe           re         Difference          S.E.
-------------+----------------------------------------------------------------
      regime |    .7194034     .8366188       -.1172153        .0664919
trade_open~s |    .0292849     .0354598       -.0061748        .0041944
   gdpgrowth |    .0618739     .0611339        .0007399        .0024548
     finance |    .0810876    -.0079567        .0890443        .0409043
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        6.14
                Prob>chi2 =      0.1887

. *@*lend
. cap log close
