--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\Github\panel_econ\exam\stata\exam_1.
> log
  log type:  text
 opened on:  20 Oct 2015, 19:58:46

. 
. 
. use CA_FX_DATA_STUD, clear  /*opening the data file */

. set matsize 800 /*Increasing the maximum allowed dimension of our data matrix 
> */

. 
. *******************************
. * Data Preparation:
. *******************************
. 
. 
. 
. * Create new variables
. cap gen abs_cagdp = abs(cagdp)

. cap gen trade_openness = importsgdp + exportsgdp

. 
. hist abs_cagdp
(bin=33, start=0, width=4.0241214)

. hist trade_openness
(bin=33, start=6.3200002, width=13.083999)

. 
. *Drop non-industrial countries
. drop if ind == 0
(1,465 observations deleted)

. 
. *run a pooled OLS regression
. reg abs_cagdp regime exportsgdp trade_openness finance gdpgrowth

      Source |       SS           df       MS      Number of obs   =       818
-------------+----------------------------------   F(5, 812)       =     52.37
       Model |   2867.5723         5  573.514459   Prob > F        =    0.0000
    Residual |  8893.10262       812  10.9520968   R-squared       =    0.2438
-------------+----------------------------------   Adj R-squared   =    0.2392
       Total |  11760.6749       817  14.3949509   Root MSE        =    3.3094

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |  -.8701295   .1580407    -5.51   0.000    -1.180346   -.5599131
   exportsgdp |  -.2382867   .0411335    -5.79   0.000    -.3190273   -.1575462
trade_openn~s |   .1529805   .0214605     7.13   0.000     .1108558    .1951052
      finance |   .3791073   .0958936     3.95   0.000     .1908787    .5673359
    gdpgrowth |    .079103   .0482342     1.64   0.101    -.0155753    .1737814
        _cons |   1.315905   .2851918     4.61   0.000     .7561046    1.875705
-------------------------------------------------------------------------------

. estat vif

    Variable |       VIF       1/VIF  
-------------+----------------------
trade_open~s |    118.93    0.008408
  exportsgdp |    116.98    0.008548
     finance |      1.40    0.712628
      regime |      1.20    0.834933
   gdpgrowth |      1.13    0.886961
-------------+----------------------
    Mean VIF |     47.93

. 
. reg abs_cagdp i.regime trade_openness finance gdpgrowth

      Source |       SS           df       MS      Number of obs   =       818
-------------+----------------------------------   F(5, 812)       =     45.37
       Model |  2568.04166         5  513.608332   Prob > F        =    0.0000
    Residual |  9192.63326       812  11.3209769   R-squared       =    0.2184
-------------+----------------------------------   Adj R-squared   =    0.2135
       Total |  11760.6749       817  14.3949509   Root MSE        =    3.3647

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |
           1  |  -1.341946   .3054244    -4.39   0.000     -1.94146   -.7424316
           2  |  -1.363191   .3162452    -4.31   0.000    -1.983946   -.7424369
              |
trade_openn~s |   .0285231   .0022225    12.83   0.000     .0241605    .0328857
      finance |   .0246702   .0911372     0.27   0.787     -.154222    .2035624
    gdpgrowth |   .1005732   .0488644     2.06   0.040     .0046578    .1964885
        _cons |   2.235696   .3184238     7.02   0.000     1.610665    2.860727
-------------------------------------------------------------------------------

. outtex, file(pooled.tex) labels level detail ///
>         legend key(stab) replace
file pooled.tex saved

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of abs_cagdp

         chi2(1)      =    60.63
         Prob > chi2  =   0.0000

. rvfplot

. graph export rvfplot_pooled.png, replace
(file rvfplot_pooled.png written in PNG format)

. 
. *Fixed effects regression
. cap encode country, gen(country2)

. xtset country2 year
       panel variable:  country2 (unbalanced)
        time variable:  year, 1974 to 2008, but with gaps
                delta:  1 unit

. 
. xtreg abs_cagdp i.regime trade_openness finance gdpgrowth, fe

Fixed-effects (within) regression               Number of obs     =        818
Group variable: country2                        Number of groups  =         29

R-sq:                                           Obs per group:
     within  = 0.0898                                         min =          7
     between = 0.5631                                         avg =       28.2
     overall = 0.2027                                         max =         35

                                                F(5,784)          =      15.47
corr(u_i, Xb)  = -0.2580                        Prob > F          =     0.0000

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |
           1  |  -1.194489   .3549857    -3.36   0.001    -1.891324   -.4976543
           2  |  -.3584729   .4239452    -0.85   0.398    -1.190675    .4737292
              |
trade_openn~s |   .0340227   .0082538     4.12   0.000     .0178206    .0502249
      finance |   .2791221   .1036569     2.69   0.007     .0756441       .4826
    gdpgrowth |   .0713649   .0452038     1.58   0.115    -.0173699    .1600996
        _cons |   1.239146   .6485251     1.91   0.056    -.0339051    2.512197
--------------+----------------------------------------------------------------
      sigma_u |   2.369493
      sigma_e |   2.861685
          rho |  .40673743   (fraction of variance due to u_i)
-------------------------------------------------------------------------------
F test that all u_i=0: F(28, 784) = 12.09                    Prob > F = 0.0000

. outtex, file(fe.tex) labels level detail ///
>         legend key(stab) replace        
file fe.tex saved

. *rvfplot (Doesn't work! too tired to workaround)
.         
. 
. 
end of do-file

