--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\Github\panel_econ\exam\stata\exam_1.
> log
  log type:  text
 opened on:  20 Oct 2015, 18:18:00

. 
. 
. use CA_FX_DATA_STUD, clear  /*opening the data file */

. set matsize 800 /*Increasing the maximum allowed dimension of our data matrix 
> */

. 
. *******************************
. * Data Preparation:
. *******************************
. 
. 
. 
. * Create new variables
. cap gen abs_cagdp = abs(cagdp)

. cap gen trade_openness = importsgdp + exportsgdp

. 
. hist abs_cagdp
(bin=33, start=0, width=4.0241214)

. hist trade_openness
(bin=33, start=6.3200002, width=13.083999)

. 
. *Drop non-industrial countries
. drop if ind == 0
(1,465 observations deleted)

. 
. *run a pooled OLS regression
. reg abs_cagdp regime exportsgdp trade_openness finance gdpgrowth

      Source |       SS           df       MS      Number of obs   =       818
-------------+----------------------------------   F(5, 812)       =     52.37
       Model |   2867.5723         5  573.514459   Prob > F        =    0.0000
    Residual |  8893.10262       812  10.9520968   R-squared       =    0.2438
-------------+----------------------------------   Adj R-squared   =    0.2392
       Total |  11760.6749       817  14.3949509   Root MSE        =    3.3094

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |  -.8701295   .1580407    -5.51   0.000    -1.180346   -.5599131
   exportsgdp |  -.2382867   .0411335    -5.79   0.000    -.3190273   -.1575462
trade_openn~s |   .1529805   .0214605     7.13   0.000     .1108558    .1951052
      finance |   .3791073   .0958936     3.95   0.000     .1908787    .5673359
    gdpgrowth |    .079103   .0482342     1.64   0.101    -.0155753    .1737814
        _cons |   1.315905   .2851918     4.61   0.000     .7561046    1.875705
-------------------------------------------------------------------------------

. estat vif

    Variable |       VIF       1/VIF  
-------------+----------------------
trade_open~s |    118.93    0.008408
  exportsgdp |    116.98    0.008548
     finance |      1.40    0.712628
      regime |      1.20    0.834933
   gdpgrowth |      1.13    0.886961
-------------+----------------------
    Mean VIF |     47.93

. 
. reg abs_cagdp regime trade_openness finance gdpgrowth

      Source |       SS           df       MS      Number of obs   =       818
-------------+----------------------------------   F(4, 813)       =     54.87
       Model |   2500.0316         4    625.0079   Prob > F        =    0.0000
    Residual |  9260.64332       813  11.3907052   R-squared       =    0.2126
-------------+----------------------------------   Adj R-squared   =    0.2087
       Total |  11760.6749       817  14.3949509   Root MSE        =     3.375

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |  -.7011815   .1584062    -4.43   0.000    -1.012115   -.3902483
trade_openn~s |   .0292931    .002207    13.27   0.000     .0249611    .0336252
      finance |   .1059332   .0851535     1.24   0.214    -.0612135    .2730799
    gdpgrowth |   .1068082   .0489481     2.18   0.029     .0107286    .2028879
        _cons |   1.841728   .2757222     6.68   0.000     1.300517    2.382939
-------------------------------------------------------------------------------

. outtex, file(pooled.tex) labels level detail legend key(stab) replace
(note: file pooled.tex not found)
file pooled.tex saved

. 
end of do-file

