--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\Github\panel_econ\exam\stata\exam_1.
> log
  log type:  text
 opened on:  20 Oct 2015, 19:24:42

. 
. 
. use CA_FX_DATA_STUD, clear  /*opening the data file */

. set matsize 800 /*Increasing the maximum allowed dimension of our data matrix 
> */

. 
. *******************************
. * Data Preparation:
. *******************************
. 
. 
. 
. * Create new variables
. cap gen abs_cagdp = abs(cagdp)

. cap gen trade_openness = importsgdp + exportsgdp

. 
. hist abs_cagdp
(bin=33, start=0, width=4.0241214)

. hist trade_openness
(bin=33, start=6.3200002, width=13.083999)

. 
. *Drop non-industrial countries
. drop if ind == 0
(1,465 observations deleted)

. 
. *run a pooled OLS regression
. reg abs_cagdp regime exportsgdp trade_openness finance gdpgrowth

      Source |       SS           df       MS      Number of obs   =       818
-------------+----------------------------------   F(5, 812)       =     52.37
       Model |   2867.5723         5  573.514459   Prob > F        =    0.0000
    Residual |  8893.10262       812  10.9520968   R-squared       =    0.2438
-------------+----------------------------------   Adj R-squared   =    0.2392
       Total |  11760.6749       817  14.3949509   Root MSE        =    3.3094

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |  -.8701295   .1580407    -5.51   0.000    -1.180346   -.5599131
   exportsgdp |  -.2382867   .0411335    -5.79   0.000    -.3190273   -.1575462
trade_openn~s |   .1529805   .0214605     7.13   0.000     .1108558    .1951052
      finance |   .3791073   .0958936     3.95   0.000     .1908787    .5673359
    gdpgrowth |    .079103   .0482342     1.64   0.101    -.0155753    .1737814
        _cons |   1.315905   .2851918     4.61   0.000     .7561046    1.875705
-------------------------------------------------------------------------------

. estat vif

    Variable |       VIF       1/VIF  
-------------+----------------------
trade_open~s |    118.93    0.008408
  exportsgdp |    116.98    0.008548
     finance |      1.40    0.712628
      regime |      1.20    0.834933
   gdpgrowth |      1.13    0.886961
-------------+----------------------
    Mean VIF |     47.93

. 
. reg abs_cagdp regime trade_openness finance gdpgrowth

      Source |       SS           df       MS      Number of obs   =       818
-------------+----------------------------------   F(4, 813)       =     54.87
       Model |   2500.0316         4    625.0079   Prob > F        =    0.0000
    Residual |  9260.64332       813  11.3907052   R-squared       =    0.2126
-------------+----------------------------------   Adj R-squared   =    0.2087
       Total |  11760.6749       817  14.3949509   Root MSE        =     3.375

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |  -.7011815   .1584062    -4.43   0.000    -1.012115   -.3902483
trade_openn~s |   .0292931    .002207    13.27   0.000     .0249611    .0336252
      finance |   .1059332   .0851535     1.24   0.214    -.0612135    .2730799
    gdpgrowth |   .1068082   .0489481     2.18   0.029     .0107286    .2028879
        _cons |   1.841728   .2757222     6.68   0.000     1.300517    2.382939
-------------------------------------------------------------------------------

. outtex, file(pooled.tex) labels level detail ///
>         legend key(stab) replace
file pooled.tex saved

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of abs_cagdp

         chi2(1)      =    48.68
         Prob > chi2  =   0.0000

. rvfplot

. graph export rvfplot_pooled.png, replace
(file rvfplot_pooled.png written in PNG format)

. 
. *Fixed effects regression
. cap encode country, gen(country2)

. xtset country2 year
       panel variable:  country2 (unbalanced)
        time variable:  year, 1974 to 2008, but with gaps
                delta:  1 unit

. 
. xtreg abs_cagdp regime trade_openness finance gdpgrowth, fe

Fixed-effects (within) regression               Number of obs     =        818
Group variable: country2                        Number of groups  =         29

R-sq:                                           Obs per group:
     within  = 0.0739                                         min =          7
     between = 0.5628                                         avg =       28.2
     overall = 0.1952                                         max =         35

                                                F(4,785)          =      15.66
corr(u_i, Xb)  = -0.3210                        Prob > F          =     0.0000

-------------------------------------------------------------------------------
    abs_cagdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       regime |  -.1391342   .2134036    -0.65   0.515    -.5580435    .2797752
trade_openn~s |   .0379011   .0082531     4.59   0.000     .0217002    .0541019
      finance |   .3906054   .0999902     3.91   0.000     .1943256    .5868852
    gdpgrowth |   .0679117   .0455587     1.49   0.136    -.0215196    .1573431
        _cons |   .4113431   .6137019     0.67   0.503    -.7933479    1.616034
--------------+----------------------------------------------------------------
      sigma_u |  2.4296342
      sigma_e |  2.8847706
          rho |  .41498154   (fraction of variance due to u_i)
-------------------------------------------------------------------------------
F test that all u_i=0: F(28, 785) = 11.71                    Prob > F = 0.0000

. *rvfplot (Doesn't work! too tired to workaround)
. outtex, file(fe.tex) labels level detail ///
>         legend key(stab) replace
file fe.tex saved

. 
end of do-file

